# # # # 类和对象

# # 面向对象编程(OOP)是一种将数据及相应的逻辑组织成对象的编程范式
# # python中的面向对象编程与函数式编程并不互斥
# # 使用对象编码<>面向对象编码
# # 面向对象编程中，类是创建对象的蓝图，创建的对象称为实例
# # 对象由成员变量(variable)和成员函数(function)组成
# # 在python中，它们被称为属性(attribute)和方法(method)
# # 实例具有属性形式的数据，具有作用域响应数据的方法
# # 类的目的是封装
#     # 数据和操作该数据的函数被绑定在一起
#     # 类的行为的实现与程序的其他部分无关(黑盒子)
# # 用于访问属性的方法称为getter，修改属性的方法称为setter
# # 两个重要的关系
#     # 组合/has-a关系：一个对象包含其它对象
#     # 继承/is-a关系：一个类继承并建立在另一个现有类之上

# --------------------------------------------------------------------------------------------
# # # 声明一个类

# # 类声明-隐式继承：一切类都(隐式地)继承自object类
# class SecretAgent:
#     pass
# # 类声明-显示继承
# class SecretAgent(object):
#     pass

# # 初始化器 __init__()
# # 初始化器是一个函数，来定义实例属性的初始值
#     # 这些实例属性是每个实例中都存在的成员变量
#     # 如果实例没有实例属性，则不用定义初始化器
# class SecretAgent:
#     def __init__(self, codename):
#         self.codename = codename
#         self._secrets = []
# # 初始化器的名称必须是__init__
#     # 必须接收至少一个参数，通常名为self，
#     # 该参数引用方法正在操作的实例
# # 实例属性是实例的一部分，需要对self使用点运算符访问
#     # 所有实例属性都在初始化器中声明
# # 初始化器不通过return关键字返回值
# # 每当创建新的类实例时，初始化器会自动调用
# mouse = SecretAgent("Mouse")
# armadillo = SecretAgent("Armadillo")
# fox = SecretAgent("Fox")
# 创建新实例时不需要传递任何内容给参数self

# # 构造器 __new__()
# # 在python中，构造函数__new__()负责实际在内存中创建实例
#     # 它是对象创建前自动调用的类中的唯一方法
#     # 除非需要对过程进行额外控制，否则不需要自定义构造函数
# def __new__(cls, *args, **kwargs):
#     return super().__new__(cls, *args, **kwargs)
# # 构造器隐式接收一个类作为第一个参数
# # 也许整个python编程生涯你都不必编写构造函数

# # 终结器
# # 在类实例生命周期结束且类实例由垃圾回收器清理时被调用
# # 只要任何对类实例的引用仍存在，就不会调用终结器
# # 一个相当无用的终结器
# class SecretAgent:
#     def __init__(self, codename):
#         self.codename = codename
#         self._secrets = []
#         print(f"Hello, agent {self.codename}!")
#     def __del__(self):
#         print(f"Agent {self.codename} has been disavowed!")
# weasel = SecretAgent("Weasel")
# weasel_2 = weasel
# print("Arrivederci, Weasel!")
# del weasel
# print("Arrivederci, Weasel_2!")
# del weasel_2
# # # 手动创建新的类实例，绑定到名称weasel上，使用del关键字删除名称
# # 当不存在对名称weasel绑定的SecreatAgent类实例的引用时
# # 该实例才由垃圾回收器清理，垃圾回收器首先调用终结器
# # 注意：del只删除名称，而不删除值，

# --------------------------------------------------------------------------------------------
# # # 属性 attribute

#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#

# --------------------------------------------------------------------------------------------
# # # 作用域命名约定

# --------------------------------------------------------------------------------------------
# # # 方法

# --------------------------------------------------------------------------------------------
# # # 特性

# --------------------------------------------------------------------------------------------
# # # 特殊方法

# --------------------------------------------------------------------------------------------
# # # 类装饰器

# --------------------------------------------------------------------------------------------
# # # 对象的结构模式匹配

# --------------------------------------------------------------------------------------------
# # # 函数式编程和面向对象编程

# --------------------------------------------------------------------------------------------
# # # 什么时候使用类？
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
